{ config, pkgs, lib, ... }:

{
  programs.neovim = {
    #######################
    ### Общие настройки ###
    #######################
    enable = true;
    defaultEditor = true;

    #######################
    ###     Плагины     ###
    #######################
    plugins = with pkgs.vimPlugins; [
      nvim-tree-lua
      lualine-nvim
    ];

    #######################
    ###   LUA конфиг    ###
    #######################
    extraLuaConfig = ''
      -----------------------------
      --     Общие настройки     --
      -----------------------------
      vim.opt.number = true              -- абсолютный номер текущей строки
      vim.opt.relativenumber = true      -- нумерация строк относительно текущей строки 
     
      -----------------------------
      --        nvim-tree        --
      -----------------------------
      require("nvim-tree").setup {}
     
      -----------------------------
      --        lualine        --
      -----------------------------
      require("lualine").setup {}
    '';

  };
}
