------------------------------------------------------------
-- Leader key
------------------------------------------------------------
vim.g.mapleader = " "    -- Лидер — пробел

------------------------------------------------------------
-- Общие настройки для всех биндов
------------------------------------------------------------
local map  = vim.keymap.set
local opts = { silent = true, noremap = true }


------------------------------------------------------------
-- Управление буферами
------------------------------------------------------------
map("n", "<leader>w", "<cmd>bdelete<CR>",    opts)  -- Закрыть текущий буфер
map("n", "<leader>l", "<cmd>bnext<CR>",      opts)  -- Следующий буфер
map("n", "<leader>h", "<cmd>bprevious<CR>", opts)  -- Предыдущий буфер

--###########################
-- Работа с буфером обмена ##
--###########################
-- Вставка --
map({ "n", "i" }, "<C-v>", '"+p',   opts) -- Вставка из system clipboard
map("i", "<C-v>", "<C-r>+", opts)         -- Вставка в insert-режиме
-- Копирование --
map({ "v", "i" }, "<C-c>", '"+y',  opts)  -- Копировать выделение
map("n", "<C-c>", '"+yy', opts)           -- Копировать строку
-- Вырезание --
map("n", "<C-x>", '"+dd', opts)           -- Вырезать строку
map("v", "<C-x>", '"+d',  opts)           -- Вырезать выделение
-- Удаление без записи в буфер --
map("n", "dd", '"_dd', opts)              -- Удалить строку
map("n", "x", '"_x', opts)                -- Удалить символ
map("v", "d", '"_d', opts)                -- Удалить выделение
-- Выделить всё + скопировать --
map({'n','v','o'}, '<leader>a', function()
    vim.cmd('normal! ggVG"+y') -- выделяем весь файл и копируем
    vim.cmd('normal! gv')      -- возвращаем выделение
end, opts)
