--                    Настройка биндингов и                        --
--                          управления                             --
---------------------------------------------------------------------

--###################################################################
--############        Секция A: Общие настройки          ############
--###################################################################
--(A1)-- Основные настройки -----------------------------------------
vim.opt.clipboard = "unnamedplus"    -- Использовать системный буфер
vim.g.mapleader   = " "              -- Лидером является пробел
--(A2)-- Переменные -------------------------------------------------
local map  = vim.keymap.set                       -- Переменная
local opts = { silent = true, noremap = true }    -- Переменная 
--###################################################################
--############     Секция B: Биндинги в Normal Mode      ############
--###################################################################
--(B1)-- Работа с текстом -------------------------------------------
map("n", "<C-c>"    , "yy"  , opts)    -- Копировать строку
map("n", "<C-x>"    , "dd"  , opts)    -- Вырезать строку
map("n", "<C-v>"    , "p"   , opts)    -- Вставить строку
map("n", "<leader>d", '"_dd', opts)    -- Удалить строку без перезаписи буфера
map("n", "<leader>x", '"_x' , opts)    -- Удалить символ без перезаписи буфера
-- Выделить всё и скопировать ---------------------------------------
map({'n','v','o'}, '<C-a>', function()
  vim.cmd('normal! ggVG"+y')    -- Выделяем весь файл и копируем
  vim.cmd('normal! gv')         -- Возвращаем выделение
end, opts)
--(B2)-- Управление буферами ----------------------------------------
map("n", "<leader>w", "<cmd>bdelete<CR>"  , opts)    -- Закрыть текущий буфер
map("n", "<leader>l", "<cmd>bnext<CR>"    , opts)    -- Следующий буфер
map("n", "<leader>h", "<cmd>bprevious<CR>", opts)    -- Предыдущий буфер
--(B3)-- Прочее -----------------------------------------------------
-- Выключение подсветки search --------------------------------------
map("n", "<Esc>", function()
  vim.cmd("nohlsearch")
end, opts)
--###################################################################
--############    Секция C: Биндинги в Insert Mode       ############
--###################################################################
--(C1)-- Выход в Normal - вставка - возврат в Insert ----------------
map("i", "<C-v>", function()
  vim.cmd('normal! "+pi')
end, opts)
--###################################################################
--############   Секция D: Биндинги в Visual Mode        ############
--###################################################################
map("v", "<C-v>"    , '"_d"+P', opts)    -- (Ctrl+V) Вставка из буфера на место выделенного текста
map("v", "<C-c>"    , '"+y'   , opts)    -- Копировать выделенный текст
map("v", "<C-x>"    , '"+d'   , opts)    -- Вырезать выделенный текст
map("v", "<leader>d", '"_d'   , opts)    -- Удалить выделенный текст


